erpdev.СХК_Расширение/src/Documents/СХК_СписаниеЯчейки/СХК_СписаниеЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СХК_СписаниеЯчейки</name>
  <registerRecords>AccumulationRegister.СХК_ТоварыНаСкладе</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснования</name>
    <type>
      <types>DocumentRef.РасходныйОрдерНаТовары</types>
    </type>
  </attributes>
  <attributes>
    <name>Собран</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыПоРаспоряжениям</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НЯчейка</name>
      <type>
        <types>CatalogRef.СХК_СкладЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоКоличество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Собран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ШКУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СобранныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.СХК_СкладЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШКУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиТовара</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Кладовщик</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/AccumulationRegisters/СХК_ТоварыНаСкладе/СХК_ТоварыНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СХК_ТоварыНаСкладе</name>
  <resources>
    <name>ВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СХК_СкладЯчейки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

erpdev.СХК_Расширение/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="57507687-e857-4627-84a6-131b6dc5555a">
    <name>Товар</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e654eb8f-cadf-4ea9-b106-6855158dcb94">
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="898c017b-174f-4670-8146-5c6e75af51c1">
    <name>МногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d257be95-baab-4cf8-b5ae-541216c91b07">
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

erpdev.СХК_Расширение/src/Enums/СтатусыРасходныхОрдеров/СтатусыРасходныхОрдеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d873fb7c-bffd-4ee5-9885-25af6032a41f">
  <name>СтатусыРасходныхОрдеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="bdc2dd3b-b02c-4815-af56-2538b334fbf4">
    <name>Отгружен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

erpdev.СХК_Расширение/src/Enums/Расш1_СтатусОтгрузкаФакт/Расш1_СтатусОтгрузкаФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Расш1_СтатусОтгрузкаФакт</name>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>Сырье</name>
  </enumValues>
</mdclass:Enum>

erpdev.СХК_Расширение/src/Documents/Расш1_ОтгрузкаФакт/Расш1_ОтгрузкаФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расш1_ОтгрузкаФакт</name>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОВодителя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПалетМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Расш1_СтатусОтгрузкаФакт</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправленно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактПалетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГСМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АмортизацияТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГСМРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КМСырье</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоШтук</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиРасходыТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьНаемнойМашины</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыСырье</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧасыГелиос</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГСМГелиос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КМГелиос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПростоя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заезд</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Выезд</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧОрдер</name>
    <attributes>
      <name>ЗаказКлиента</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>ТК</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТарифПлан2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТарифФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТарифФакт2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПалет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Возврат</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧОтгрузка</name>
    <attributes>
      <name>Отгрузка</name>
      <type>
        <types>DocumentRef.РасходныйОрдерНаТовары</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Приобретение</name>
    <attributes>
      <name>ПоступлениеУслуг</name>
      <type>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Движение</name>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачальноеПоложение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонечноеПоложение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоординатыСтарт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоординатыСтоп</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/Documents/СХК_СписаниеЯчейки/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Для Каждого стр Из ТоварыПоРаспоряжениям Цикл
		Если стр.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.МногооборотнаяТара Тогда
			стр.Собран = Истина;
		Иначе
			//НСтр = ПолучитьНомерСтрокиДокумента(стр.Номенклатура, стр.Серия, стр.Упаковка);
			//Если ТИПЗНЧ(НСтр) = ТИП("Число") Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("Номенклатура", стр.Номенклатура);
				Отбор.Вставить("Серия", стр.Серия);
		    	Отбор.Вставить("ШКУпаковки",стр.ШКУпаковки);
				Строки = СобранныеТовары.НайтиСтроки(Отбор);
				итКол = 0;
				Если Строки.Количество() >= 1 Тогда

					Для сч = 0 По Строки.Количество() - 1 Цикл
						итКол = итКол + Строки[сч].Количество;
						Если итКол = стр.Количество Тогда
							стр.Собран = Истина;
						Иначе
							Продолжить;
						КонецЕсли;
					КонецЦикла;

				КонецЕсли;
			//Иначе
			//	ТоварыПоРаспоряжениям.Удалить(стр);
			//КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
	Отбор = Новый Структура;
	Отбор.Вставить("Собран",Ложь);
	
	ПСтроки = ТоварыПоРаспоряжениям.НайтиСтроки(Отбор);
	
	Если ПСтроки.Количество() = 0 Тогда 
		Собран = Истина;
	Иначе
		Собран = Ложь;
	КонецЕсли;

	ТабПользователей = СобранныеТовары.Выгрузить();
	ТабПользователей.Свернуть("Кладовщик"); 
	Ком = "";
	Для Каждого стр из ТабПользователей Цикл 
		Если ЗначениеЗаполнено(стр.Кладовщик)  Тогда
			Ком = Ком + Строка(стр.Кладовщик) + Символы.ПС ;
		КонецЕсли;
	КонецЦикла;
	Комментарий = Ком ;
	
КонецПроцедуры


Функция ПолучитьНомерСтрокиДокумента(Ном,Сер,Уп)
	
	ош = "";
	
	Таб = ДокОснования.Ссылка.ОтгружаемыеТовары.Выгрузить(); 
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура",Ном);
	Отбор.Вставить("Серия",Сер);
	Отбор.Вставить("Упаковка",Уп);
	
	Строки = Таб.НайтиСтроки(Отбор);
	Если Строки.Количество() >= 1 Тогда
		Если Строки[0].Действие <> Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.НеОтгружать Тогда
			Возврат Число(Строки[0].НомерСтроки);
		Иначе
			ош = "Эту позицию НЕ ОТГРУЖАТЬ";
		КонецЕсли;
	Иначе
		ош = "Ошибка в документе";
	КонецЕсли;
	
	Возврат ош;
	
КонецФункции


Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.СХК_ТоварыНаСкладе.Записывать = Истина;
	Для Каждого ТекСтрокаТЧТовары Из СобранныеТовары Цикл
		Движение = Движения.СХК_ТоварыНаСкладе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТЧТовары.Номенклатура;
		Движение.Серия = Строка(ТекСтрокаТЧТовары.Серия);
		Движение.Ячейка = ТекСтрокаТЧТовары.Ячейка;
		Движение.ВНаличии = ТекСтрокаТЧТовары.Количество;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ) 
	
	Если ПроверитьРО() Тогда 
		Собран = Ложь;  
		СобранныеТовары.Очистить(); 
		ТТ = ТоварыПоРаспоряжениям.Выгрузить();
		ТТ.ЗаполнитьЗначения(Ложь, "Собран"); 
		ТоварыПоРаспоряжениям.Загрузить(ТТ);
		
		РО = ДокОснования.ПолучитьОбъект();
		Если РО.Проведен Тогда
			РО.Статус = Перечисления.СтатусыРасходныхОрдеров.Подготовлен;
			ТабРО = ДокОснования.ОтгружаемыеТовары.Выгрузить();
			ТабРО.ЗаполнитьЗначения(Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.НеОтгружать, "Действие"); 
			РО.ОтгружаемыеТовары.Загрузить(ТабРО);
			РО.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		ВернутьТоварВБуфер();

	Иначе              
		Сообщить("Распроведите всю цепочку документов !!!");
		Отказ = Истина;
	КонецЕсли;
	
	
	
	
	
КонецПроцедуры 

Функция ПроверитьРО()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	Расш1_ОтгрузкаФакт.Ссылка КАК Ссылка
					|ИЗ
					|	Документ.Расш1_ОтгрузкаФакт КАК Расш1_ОтгрузкаФакт
					|ГДЕ
					|	Расш1_ОтгрузкаФакт.Проведен = Истина
					|	И Расш1_ОтгрузкаФакт.ПометкаУдаления = Ложь
					|	И Расш1_ОтгрузкаФакт.ТЧОтгрузка.Отгрузка = &Отгрузка
					|	И Расш1_ОтгрузкаФакт.Статус = Значение(Перечисление.Расш1_СтатусОтгрузкаФакт.Отгружен)";
	Запрос.УстановитьПараметр("Отгрузка",ДокОснования.Ссылка);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;	
	КонецЕсли;
	
КонецФункции 

Процедура ВернутьТоварВБуфер()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СХК_СписаниеЯчейкиСобранныеТовары.Номенклатура КАК Номенклатура,
	               |	СХК_СписаниеЯчейкиСобранныеТовары.Серия КАК Серия,
	               |	СУММА(СХК_СписаниеЯчейкиСобранныеТовары.Количество) КАК Количество,
	               |	&Ячейка КАК Ячейка,
	               |	СХК_СписаниеЯчейкиСобранныеТовары.Упаковка КАК Упаковка,&Время КАК Время ,
				   |	СУММА(СХК_СписаниеЯчейкиСобранныеТовары.Количество) /  СХК_СписаниеЯчейкиСобранныеТовары.Упаковка.Числитель КАК КоличествоУпаковок ,
				   |    &Пользователь КАК Пользователь
	               |ИЗ
	               |	Документ.СХК_СписаниеЯчейки.СобранныеТовары КАК СХК_СписаниеЯчейкиСобранныеТовары
	               |ГДЕ
	               |	СХК_СписаниеЯчейкиСобранныеТовары.Ссылка.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СХК_СписаниеЯчейкиСобранныеТовары.Номенклатура,
	               |	СХК_СписаниеЯчейкиСобранныеТовары.Серия,
	               |	СХК_СписаниеЯчейкиСобранныеТовары.Ячейка,
	               |	СХК_СписаниеЯчейкиСобранныеТовары.Упаковка"; 
	Запрос.УстановитьПараметр("Ссылка",Ссылка);  
	Запрос.УстановитьПараметр("Пользователь",Пользователи.АвторизованныйПользователь());  
	Запрос.УстановитьПараметр("Время",ТекущаяДата());
	Запрос.УстановитьПараметр("Ячейка",Справочники.СХК_СкладЯчейки.НайтиПоКоду("000000372"));
	
	Док = Документы.Расш1_ПоступлениеСклад.СоздатьДокумент();
	Док.Дата = ТекущаяДата();
	Док.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Док.Записать(РежимЗаписиДокумента.Запись);
		Сообщить("При проведении возникли ошибки");
	КонецПопытки;
	
КонецПроцедуры
